# SQL Example
Let's create the following database, remember that our first step should be to hit the terminal and start up postgresql with `sudo service postgresql start`
![](example_er.png)

In [1]:
%load_ext sql
%sql postgres://jovyan:si330studentuser@localhost:5432/si330

'Connected: jovyan@si330'

In [2]:
%%sql
drop table if exists assignment;
drop table if exists users;
drop table if exists assignment_attempt;

CREATE TABLE "assignment" (
  "id" integer,
  "descr" varchar,
  "num_points" integer,
  PRIMARY KEY ("id")
);

CREATE TABLE "users" (
  "username" varchar,
  PRIMARY KEY ("username")
);

CREATE TABLE "assignment_attempt" (
  "timestamp" timestamp,
  "user" varchar,
  "assignment" integer,
  "points_awarded" integer,
  PRIMARY KEY ("timestamp", "user")
);

CREATE INDEX "FK" ON  "assignment_attempt" ("assignment");

 * postgres://jovyan:***@localhost:5432/si330
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [3]:
%sql insert into users (username) values ('brooksch')

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[]

In [4]:
%sql select * from users

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[('brooksch',)]

In [5]:
%sql select username from users

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[('brooksch',)]

In [6]:
%sql insert into users (username) values ('cab938-1'),('cab938-2'),('cab938-3')

 * postgres://jovyan:***@localhost:5432/si330
3 rows affected.

[]

In [7]:
%sql select * from users

 * postgres://jovyan:***@localhost:5432/si330
4 rows affected.

[('brooksch',), ('cab938-1',), ('cab938-2',), ('cab938-3',)]

In [8]:
import string
string.ascii_letters

'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'

In [9]:
import random
random.sample(string.ascii_letters,6)

['F', 'm', 'K', 'Q', 'C', 'x']

In [12]:
lst=random.sample(string.ascii_letters,6)
our_strng=""
for i in lst:
    our_strng+=i
our_strng

'QjVXaB'

In [14]:
"".join(random.sample(string.ascii_letters,6))

'SqVdcX'

In [15]:
import string
import random
for i in range(0,10):
    random_characters=random.sample(string.ascii_letters,6)
    user="".join(random_characters)
    user="'"+user+"'"
    print("I'm going to try and insert {} as a user!".format(user))
    %sql insert into users (username) values ($user)
%sql select * from users

I'm going to try and insert 'suiWcd' as a user!
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
I'm going to try and insert 'mwrjMG' as a user!
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
I'm going to try and insert 'viezHE' as a user!
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
I'm going to try and insert 'ObeIuf' as a user!
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
I'm going to try and insert 'ZGMSye' as a user!
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
I'm going to try and insert 'inRgxM' as a user!
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
I'm going to try and insert 'qJOiQn' as a user!
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
I'm going to try and insert 'wMaRtb' as a user!
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
I'm going to try and insert 'sxjXtv' as a user!
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
I'm going to try and insert 'uJmLWs' as a user!
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
14 rows affected.

[('brooksch',),
 ('cab938-1',),
 ('cab938-2',),
 ('cab938-3',),
 ('suiWcd',),
 ('mwrjMG',),
 ('viezHE',),
 ('ObeIuf',),
 ('ZGMSye',),
 ('inRgxM',),
 ('qJOiQn',),
 ('wMaRtb',),
 ('sxjXtv',),
 ('uJmLWs',)]

In [19]:
import string
import random
sql_string="insert into users (username) values "
for i in range(0,10):
    random_characters=random.sample(string.ascii_letters,6)
    user="".join(random_characters)
    user="('"+user+"'),"
    sql_string+=user
sql_string=sql_string[0:-1]

%sql $sql_string
%sql select * from users

 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
24 rows affected.

[('brooksch',),
 ('cab938-1',),
 ('cab938-2',),
 ('cab938-3',),
 ('suiWcd',),
 ('mwrjMG',),
 ('viezHE',),
 ('ObeIuf',),
 ('ZGMSye',),
 ('inRgxM',),
 ('qJOiQn',),
 ('wMaRtb',),
 ('sxjXtv',),
 ('uJmLWs',),
 ('wQGICg',),
 ('zYBbMX',),
 ('zxvgFq',),
 ('LfIkWO',),
 ('pHVWTY',),
 ('dUtuPp',),
 ('qzEHWO',),
 ('jCKTuv',),
 ('pqsUZf',),
 ('glIxbE',)]

In [ ]:
# Now you try, populate the assignment table with half a dozen assignments

In [23]:
for i in range(1,6):
    %sql insert into assignment (id,descr,num_points) values ($i,'sample assignment',100)

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

In [24]:
%sql select * from assignment

 * postgres://jovyan:***@localhost:5432/si330
6 rows affected.

[(0, 'sample assignment', 100),
 (1, 'sample assignment', 100),
 (2, 'sample assignment', 100),
 (3, 'sample assignment', 100),
 (4, 'sample assignment', 100),
 (5, 'sample assignment', 100)]

In [25]:
# Now lets generate some random user attempt data
users=%sql select username from users
users

 * postgres://jovyan:***@localhost:5432/si330
24 rows affected.

[('brooksch',),
 ('cab938-1',),
 ('cab938-2',),
 ('cab938-3',),
 ('suiWcd',),
 ('mwrjMG',),
 ('viezHE',),
 ('ObeIuf',),
 ('ZGMSye',),
 ('inRgxM',),
 ('qJOiQn',),
 ('wMaRtb',),
 ('sxjXtv',),
 ('uJmLWs',),
 ('wQGICg',),
 ('zYBbMX',),
 ('zxvgFq',),
 ('LfIkWO',),
 ('pHVWTY',),
 ('dUtuPp',),
 ('qzEHWO',),
 ('jCKTuv',),
 ('pqsUZf',),
 ('glIxbE',)]

In [26]:
# Wait, what is this object?
print(type(users))

<class 'sql.run.ResultSet'>

In [27]:
# We can leave it as is to iterate over it
for user in users:
    print(user)

('brooksch',)
('cab938-1',)
('cab938-2',)
('cab938-3',)
('suiWcd',)
('mwrjMG',)
('viezHE',)
('ObeIuf',)
('ZGMSye',)
('inRgxM',)
('qJOiQn',)
('wMaRtb',)
('sxjXtv',)
('uJmLWs',)
('wQGICg',)
('zYBbMX',)
('zxvgFq',)
('LfIkWO',)
('pHVWTY',)
('dUtuPp',)
('qzEHWO',)
('jCKTuv',)
('pqsUZf',)
('glIxbE',)

In [28]:
# Notice that every element in the list is a tuple, but a tuple of length one.
clean_users=[]
for user in users:
    clean_users.append(user[0])
    print(user[0])

brooksch
cab938-1
cab938-2
cab938-3
suiWcd
mwrjMG
viezHE
ObeIuf
ZGMSye
inRgxM
qJOiQn
wMaRtb
sxjXtv
uJmLWs
wQGICg
zYBbMX
zxvgFq
LfIkWO
pHVWTY
dUtuPp
qzEHWO
jCKTuv
pqsUZf
glIxbE

In [29]:
# Let's get the assignments list as well
assignments=%sql select id from assignment
assignments=list(map(lambda z: z[0], assignments))
print(assignments)

 * postgres://jovyan:***@localhost:5432/si330
6 rows affected.
[0, 1, 2, 3, 4, 5]

In [30]:
# Notice that %sql unpacks the correct type information for us too
print(type(assignments[0]))

<class 'int'>

In [32]:
print(clean_users)
print(assignments)

['brooksch', 'cab938-1', 'cab938-2', 'cab938-3', 'suiWcd', 'mwrjMG', 'viezHE', 'ObeIuf', 'ZGMSye', 'inRgxM', 'qJOiQn', 'wMaRtb', 'sxjXtv', 'uJmLWs', 'wQGICg', 'zYBbMX', 'zxvgFq', 'LfIkWO', 'pHVWTY', 'dUtuPp', 'qzEHWO', 'jCKTuv', 'pqsUZf', 'glIxbE']
[0, 1, 2, 3, 4, 5]

In [33]:
# Ok, now we have a list of assignments and a list of users. These are our foreign keys in assignment_attempt!
# So lets make some attempts
import datetime

for i in range(0,100):
    user=random.choice(clean_users)
    assignment=random.choice(assignments)
    points=random.randint(0,100)
    timestamp=datetime.datetime.now()
    
    user="'{}'".format(user)
    timestamp="'{}'".format(timestamp)
    
    %sql insert into assignment_attempt (timestamp,"user",assignment,points_awarded) values ($timestamp, $user, $assignment, $points)

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

In [34]:
# Let's see what we have in there
%sql select * from assignment_attempt limit 10

 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.

[(datetime.datetime(2019, 12, 2, 14, 31, 24, 406072), 'viezHE', 5, 76),
 (datetime.datetime(2019, 12, 2, 14, 31, 24, 411427), 'qJOiQn', 0, 29),
 (datetime.datetime(2019, 12, 2, 14, 31, 24, 414247), 'qJOiQn', 5, 88),
 (datetime.datetime(2019, 12, 2, 14, 31, 24, 416857), 'jCKTuv', 5, 99),
 (datetime.datetime(2019, 12, 2, 14, 31, 24, 419301), 'cab938-1', 0, 32),
 (datetime.datetime(2019, 12, 2, 14, 31, 24, 421968), 'cab938-2', 3, 8),
 (datetime.datetime(2019, 12, 2, 14, 31, 24, 424329), 'viezHE', 0, 17),
 (datetime.datetime(2019, 12, 2, 14, 31, 24, 426644), 'qzEHWO', 5, 27),
 (datetime.datetime(2019, 12, 2, 14, 31, 24, 428901), 'pHVWTY', 1, 11),
 (datetime.datetime(2019, 12, 2, 14, 31, 24, 431243), 'ObeIuf', 5, 61)]

In [35]:
%sql select points_awarded from assignment_attempt

 * postgres://jovyan:***@localhost:5432/si330
100 rows affected.

[(76,),
 (29,),
 (88,),
 (99,),
 (32,),
 (8,),
 (17,),
 (27,),
 (11,),
 (61,),
 (38,),
 (23,),
 (54,),
 (90,),
 (39,),
 (58,),
 (100,),
 (6,),
 (79,),
 (14,),
 (56,),
 (18,),
 (22,),
 (86,),
 (76,),
 (91,),
 (18,),
 (28,),
 (3,),
 (68,),
 (8,),
 (53,),
 (50,),
 (15,),
 (67,),
 (33,),
 (74,),
 (22,),
 (68,),
 (90,),
 (44,),
 (75,),
 (68,),
 (27,),
 (83,),
 (67,),
 (58,),
 (16,),
 (72,),
 (86,),
 (95,),
 (57,),
 (11,),
 (49,),
 (74,),
 (32,),
 (52,),
 (56,),
 (26,),
 (60,),
 (50,),
 (41,),
 (94,),
 (30,),
 (96,),
 (82,),
 (24,),
 (80,),
 (99,),
 (23,),
 (69,),
 (91,),
 (29,),
 (46,),
 (40,),
 (79,),
 (62,),
 (41,),
 (0,),
 (68,),
 (52,),
 (46,),
 (92,),
 (40,),
 (25,),
 (74,),
 (83,),
 (40,),
 (21,),
 (75,),
 (22,),
 (26,),
 (47,),
 (35,),
 (85,),
 (86,),
 (25,),
 (69,),
 (5,),
 (43,)]

In [36]:
# Ok, let's amp this up a bit. We can do some aggregations on this data just like in pandas. We do this by
# indicating the sql function we want to run around the selection parameters
%sql select max(points_awarded) from assignment_attempt

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(100,)]

In [37]:
# You can have multiple values being projected in that select, and you can name the return columns with the as keyword
%sql select max(points_awarded) as max_column, min(points_awarded) as bluebird, avg(points_awarded) as mean from assignment_attempt

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(100, 0, Decimal('51.3800000000000000'))]

In [ ]:
# now you try it, get the standard deviation with stddev() and the total number of entries with count()

In [39]:
%sql select stddev(points_awarded), count(points_awarded) from assignment_attempt

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(Decimal('27.8044324640238727'), 100)]

In [40]:
# What if you want to find out the average of each person's score?
%sql select user, avg(points_awarded) as average from assignment_attempt

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[('jovyan', Decimal('51.3800000000000000'))]

In [ ]:
# Hrm. We expected there to be a lot of users there! But there is only one! What is happening here?

In [41]:
%sql select "user", avg(points_awarded) as average from assignment_attempt

 * postgres://jovyan:***@localhost:5432/si330
(psycopg2.errors.GroupingError) column "assignment_attempt.user" must appear in the GROUP BY clause or be used in an aggregate function
LINE 1: select "user", avg(points_awarded) as average from assignmen...
               ^

[SQL: select "user", avg(points_awarded) as average from assignment_attempt]
(Background on this error at: http://sqlalche.me/e/f405)

In [ ]:
# Ok, that's better, now instead of returning the username of the connect it's grabbing the right column.
# What is this error all about though? Why don't we double check out approach with pandas

In [42]:
host="localhost"
dbname="si330"
user="jovyan"
password="si330studentuser"

import psycopg2
conn = psycopg2.connect(host=host,dbname=dbname, user=user, password=password)

import pandas as pd
import numpy as np
df=pd.read_sql("select * from assignment_attempt", conn)
df.head()

                   timestamp      user  assignment  points_awarded
0 2019-12-02 14:31:24.406072    viezHE           5              76
1 2019-12-02 14:31:24.411427    qJOiQn           0              29
2 2019-12-02 14:31:24.414247    qJOiQn           5              88
3 2019-12-02 14:31:24.416857    jCKTuv           5              99
4 2019-12-02 14:31:24.419301  cab938-1           0              32

In [43]:
df[["user","points_awarded"]].apply(np.mean)

TypeError: ('Could not convert viezHEqJOiQnqJOiQnjCKTuvcab938-1cab938-2viezHEqzEHWOpHVWTYObeIufqzEHWOpHVWTYjCKTuvwMaRtbwMaRtbcab938-3viezHEObeIufzxvgFqpqsUZfwQGICgdUtuPpinRgxMObeIufwMaRtbpHVWTYObeIufsxjXtvpHVWTYqzEHWOsxjXtvbrookschwMaRtbglIxbEviezHEviezHEzYBbMXbrookschcab938-2cab938-1LfIkWOsuiWcdviezHEinRgxMqzEHWOinRgxMviezHEinRgxMpqsUZfsxjXtvsxjXtvsuiWcdglIxbEObeIufLfIkWOsxjXtvbrookschpqsUZfdUtuPpLfIkWOpHVWTYsuiWcdmwrjMGviezHEviezHEwQGICgbrookschcab938-1zxvgFqjCKTuvcab938-3pHVWTYwMaRtbqJOiQnsuiWcdjCKTuvmwrjMGObeIufcab938-2sxjXtvjCKTuvsxjXtvsuiWcdinRgxMviezHEviezHELfIkWOLfIkWOObeIufpqsUZfqzEHWOsxjXtvpHVWTYpHVWTYqJOiQnsuiWcdzxvgFqviezHEqJOiQnwMaRtb to numeric', 'occurred at index user')

In [ ]:
# Ok, so our problem is that we are trying to aggregate a username which makes no sense.
# In pandas though, how would we solve this?

In [44]:
df[["user","points_awarded"]].groupby("user").apply(np.mean)

          points_awarded
user
LfIkWO         60.200000
ObeIuf         40.285714
brooksch       37.750000
cab938-1       67.333333
cab938-2       25.333333
cab938-3       63.500000
dUtuPp         22.000000
glIxbE         13.000000
inRgxM         34.400000
jCKTuv         61.400000
mwrjMG         78.000000
pHVWTY         43.875000
pqsUZf         54.250000
qJOiQn         50.600000
qzEHWO         47.600000
suiWcd         65.166667
sxjXtv         48.625000
viezHE         59.416667
wMaRtb         54.500000
wQGICg         69.000000
zYBbMX         74.000000
zxvgFq         67.666667

In [45]:
# We can do the same thing in SQL!
%sql select "user", avg(points_awarded) from assignment_attempt group by "user"

 * postgres://jovyan:***@localhost:5432/si330
22 rows affected.

[('jCKTuv', Decimal('61.4000000000000000')),
 ('pqsUZf', Decimal('54.2500000000000000')),
 ('qzEHWO', Decimal('47.6000000000000000')),
 ('sxjXtv', Decimal('48.6250000000000000')),
 ('cab938-1', Decimal('67.3333333333333333')),
 ('viezHE', Decimal('59.4166666666666667')),
 ('brooksch', Decimal('37.7500000000000000')),
 ('wQGICg', Decimal('69.0000000000000000')),
 ('wMaRtb', Decimal('54.5000000000000000')),
 ('glIxbE', Decimal('13.0000000000000000')),
 ('cab938-3', Decimal('63.5000000000000000')),
 ('LfIkWO', Decimal('60.2000000000000000')),
 ('zxvgFq', Decimal('67.6666666666666667')),
 ('inRgxM', Decimal('34.4000000000000000')),
 ('dUtuPp', Decimal('22.0000000000000000')),
 ('qJOiQn', Decimal('50.6000000000000000')),
 ('cab938-2', Decimal('25.3333333333333333')),
 ('mwrjMG', Decimal('78.0000000000000000')),
 ('ObeIuf', Decimal('40.2857142857142857')),
 ('zYBbMX', Decimal('74.0000000000000000')),
 ('pHVWTY', Decimal('43.8750000000000000')),
 ('suiWcd', Decimal('65.1666666666666667'))]

In [48]:
# whats the deal with double quotes?
# double quotes mean the precise or exact representation of the string should be used
# this is useful for reserved words

 * postgres://jovyan:***@localhost:5432/si330
(psycopg2.errors.SyntaxError) syntax error at or near "#"
LINE 1: # whats the deal with double quotes?
        ^

[SQL: # whats the deal with double quotes?
# double quotes mean the precise or exact representation of the string should be used
# this is useful for reserved words
create table as "Questions" (
id integer
);]
(Background on this error at: http://sqlalche.me/e/f405)

In [53]:
%%sql
drop table "Questions";

 * postgres://jovyan:***@localhost:5432/si330
Done.

[]

In [55]:
%%sql
create table Questions (
id integer
);

 * postgres://jovyan:***@localhost:5432/si330
Done.

[]

In [56]:
%sql select * from questions

 * postgres://jovyan:***@localhost:5432/si330
0 rows affected.

[]

In [ ]:
# A nice summary bit of data
%sql select "user" as username, count(*) as attempts_made, avg(points_awarded) as average_score, stddev(points_awarded) as stddev_score from assignment_attempt group by "user" order by username desc

In [ ]:
# Remember that we can restrict our queries based on the values of rows as well
%sql select * from assignment_attempt where points_awarded > 90

In [ ]:
# And you can have as many of the where clauses as you want
%sql select * from assignment_attempt where points_awarded > 90 and points_awarded < 95

In [ ]:
# There is some handy pattern matching in the where clauses too, which look a little bit like regex
%sql select * from assignment_attempt where "user" like '%c%' and "user" not like '%d%'

In [ ]:
# In truth, the regex functionality in standard SQL is very poor. This makes me very sad. However, postgres implements this as a function using substring()!

In [ ]:
# The result of each SQL query is a table (a relation). This means you can execute SQL against it. Beautifully recursive!
%sql select "user", avg(points_awarded) from assignment_attempt group by "user"

In [ ]:
%%sql
select username, average from (select "user" as username, avg(points_awarded) as average from assignment_attempt group by "user") as subtable where subtable.average > 60

In [ ]:
# This gets hard to read. Often we want to pretty print it.
# http://www.dpriver.com/pp/sqlformat.htm

In [ ]:
%%sql
SELECT username, 
       average 
FROM   (SELECT "user"              AS username, 
               Avg(points_awarded) AS average 
        FROM   assignment_attempt 
        GROUP  BY "user") AS subtable 
WHERE  subtable.average > 60